app/Controllers/BaseController.php

    public function isRole($role) {
        if (!session()->get("user_id")) {
            return false;
        }
        $user = new UserModel();
        if ($user->where("id", session()->get("user_id"))->first()->role == $role) {
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1