app/Controllers/Home.php

    public function index()
    {
        $products = $this->productModel->findAll();
        $transactionData = [];
        foreach ($products as $k=>$v) {
            array_push($transactionData,[
                "product_id"=>$v->id,
                "product_name"=>$v->nama,
                "transaction"=>$this->transactionModel->getTransactionsPerMonth($v->id,intval($this->request->getGet("year")?? date("Y")))
            ]);
        }

        if (session()->get("user_id")) {
            return view("owner/index", [
                "outletCount" => count($this->outletModel->findAll()),
                "salesCount" => count($this->userModel->where("role", "sales")->findAll()),
                "productCount" => count($products),
                "transactionData" => $transactionData,
                "year" => intval($this->request->getGet("year") ?? date("Y"))
            ]);
---
SELECT *
FROM `products`
SELECT SUM(`count`) AS `count`
FROM `transactions`
WHERE `product_id` = '1'
AND `outlet_id` = '1'
AND `count` < 0
 LIMIT 1
SELECT *
FROM `outlets`
SELECT *
FROM `users`
WHERE `role` = 'sales'