app/Controllers/Home.php

SELECT *
FROM `outlets`
SELECT *
FROM `users`
WHERE `role` = 'sales'
---
        }

        if ($this->isRole("owner") || $this->isRole("admin")) {
            return view("owner/index", [
                "outletCount" => count($this->outletModel->findAll()),
                "salesCount" => count($this->userModel->where("role", "sales")->findAll()),
                "productCount" => count($products),
                "products" => $products,
                "transactionData" => $transactionData,
                "outletsData" => $outletsKV,
                "year" => intval($this->request->getGet("year") ?? date("Y"))
            ]);