app/Controllers/Products.php

    public function index()
    {
        if ($this->isRole("owner") || $this->isRole("admin")) {

            return view("pages/products",[
                "products"=>$this->productModel->findAll()
            ]);
---
SELECT *
FROM `products`

    public function delete($id) {
        $this->productModel->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('10')

    public function modify($id) {
        $product = $this->productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'