app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `id` != '3'
---
    public function index()
    {
        if ($this->isRole("owner") || $this->isRole("admin")) {
            $users = $this->userModel->where("id !=",session()->get("user_id"))->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function modify($id) {
        $user = $this->userModel->find($id);